/* Task 1 is done !
ООП - обьекто ориентированные прогроммирование.
Это стиль прогроммирования которое строется вокруг обьектов.Взаимодействуюшихь
друг с другом.*/

/*Task 2 is done !
Класс это шаблон (накша) с помошью которого мы показываем какие свойства 
будут у обьекта.Обьект это уже гтовый класс который иммет свои качество.
К примеру у обьектов могут быть разные цвета названия размеры и так даллее.*/

/* Task 3 is done !
Поля дар даруни класс чойгир аст вайо асосан private мебошанд.
Мисол private string _name; private int _age; private string _lastname;
Cвойства дает нам доступ к private (зишишенным данным) чтобы было безопаснее.
Cвойства устанвливает значения и возвращает его.С помощью Get и Set;
Get возврашает занчанеия с return;
Set вставляет значения с value;
Структура Свойства у него есть Модификатор в начале (public) тип данных 
например (string) и назавния.
Еще есть init который выполняеть функцию set но в отличии от set  init - неизменяемый.

/* Task 4 is done !
Конструктор это метод который инициализиурует обьект.То есть сразу 
можно писать значения обьектов.Конструктор имеет Модификатор названия класса и параметры;
В С# появилось возможность сократить конструктор тоесть после new не писать имя класса
а сразу писать значения.С помощью констурктура мы даже можем иметь доступ к private
В С# есть также есть Первечные Конструкторы.Они упрощать задачу то есть сразу
мы можем создать констуктор так: public class Person(string name, int age){}
В выше указанномм примере параметры конструктора также выполняють роль Полей.
Еще есть Деконструктор который разделять обьект на разные части.*/

/* Task 5 is done !
Инкапсуляция это принцип ООП.Имеет поля и в основном строится на private.
Код боллее чистий, логически структурированый и зашишенный;
*/


/*
Модифатор обеспечивает нам доступ.То есть откуда мы можем работать вне класа или внутр класса.
Модификатор 7:
public
private
private protected
protected interpal
interpal
files
protected
*/

